Checking out license 'RTL_Compiler_Ultra'... (1 second elapsed)
Reading GUI preferences file '/home/igosul/.cadence/rc.gui'.
Finished loading tool scripts (14 seconds elapsed)

                       Cadence Encounter(R) RTL Compiler
          Version RC12.22 - v12.20-s014_1 (64-bit), built Aug  2 2013


Copyright notice: Copyright 1997-2012 Cadence Design Systems, Inc. All rights 
reserved worldwide. 

WARNING: This version of RC is 605 days old.
         Visit downloads.cadence.com for the latest release of RC.


================================================================================
                  Welcome to Cadence Encounter(R) RTL Compiler

Notice: Upcoming end of support for Linux 32-bit.
Support for Linux 32-bit will be discontinued starting with the RC 13.1 release.
To ensure continued access to the forthcoming releases, RC 13.1 and up, you are
advised to start the transitioning to Linux 64-bit.

Here is a quick introduction on how to access our product information.  
If you do not want this message to appear in the future, create an 
initialization file (an empty file will do) in your home directory 
called '~/.cadence/.synth_init'.

  To access the product documentation in HTML and PDF, type 'cdnshelp'
    at the system prompt. 
  For a list of available commands, type 'help'. 
  To view a man page for a command, type 'man <commandName>'.
  To view a man page for an error message, type 'man <messageID>'.
  For a list of all possible object types, type 'get_attribute -help'.
  For a list of all available attributes by object type, type
    'get_attribute * <object_type> -help'.
  For a list of all attributes for every object type, type
    'get_attribute * * -help'
  To list only writable attributes, substitute 'get_attribute' with
    'set_attribute'.
  To get a template script to run RTL Compiler, use the 'write_template'
    command.
  To get a template script to run Conformal based on the current RTL
    Compiler session, use the 'write_do_lec' command.
  
  Obsolete attributes in the current tool version.
  To learn more, type 'get_attribute -help <attribute> <object>'.

            object  attribute
            ------  ---------
       cpf_command  synthesize_complex_expressions
    cpf_command_id  current_set_instance_macro
    cpf_command_id  current_set_instance_module
    cpf_command_id  done_in_apply_cpf
    cpf_command_id  done_in_write_cpf
    cpf_command_id  macro_definition_command
    cpf_command_id  rc_command
            design  dp_perform_rewriting_operations
            design  lp_map_to_srpg_cells
            design  lp_optimize_dynamic_power_first
            design  lp_srpg_pg_driver
          instance  black_box
          instance  dft_inherited_dont_scan
          instance  lp_map_to_srpg_cells
          instance  lp_map_to_srpg_type
          instance  lp_srpg_pg_driver
           libcell  black_box
           libcell  location
               net  logic0_driven
               net  logic1_driven
              root  auto_ungroup_min_effort
              root  degenerate_complex_seqs
              root  disable_power_mode
              root  dp_perform_csa_operations
              root  dp_perform_rewriting_operations
              root  dp_perform_sharing_operations
              root  dp_perform_speculation_operations
              root  driver_for_unloaded_ports
              root  enable_parallel_iopt
              root  exact_match_seqs_async_controls
              root  hdl_flatten_array
              root  hdl_old_reg_naming
              root  hdl_reg_naming_style_scalar
              root  hdl_reg_naming_style_vector
              root  hdl_trim_target_index
              root  ignore_unknown_embedded_commands
              root  lbr_async_clr_pre_seqs_interchangable
              root  ovf_mode
              root  ovf_verification_directory
              root  ple_parameter_source_priority
              root  pqos_mp_constraints
              root  pqos_virtual_buffer
              root  retime_preserve_state_points
              root  wlec_env_var
              root  wlec_flat_r2n
              root  wlec_no_exit
              root  wlec_old_lp_ec_flow
              root  wlec_save_ssion
              root  wlec_sim_lib
              root  wlec_sim_plus_lib
              root  wlec_skip_iso_check_hier_compare
              root  wlec_skip_lvl_check_hier_compare
              root  wlec_verbose
         subdesign  allow_csa_subdesign
         subdesign  allow_sharing_subdesign
         subdesign  allow_speculation_subdesign
         subdesign  auto_ungroup_ok
         subdesign  dp_perform_rewriting_operations

Send us feedback at rc_feedback@cadence.com.
================================================================================

rc:/> set_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7
  Setting attribute of root '/': 'lib_search_path' = /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7
rc:/> ;5Aset_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7 /GENERIC_CORE_1D2V/FrontEnd/synopsys/ /
invalid command name "5Aset_attribute"
rc:/> [H[2Jrc:/> clear
[H[2Jrc:/> set_attribute lib_search_path /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7/GENERIC_CORE_1D2V/FrontEnd/synopsys/ /
  Setting attribute of root '/': 'lib_search_path' = /tech/umc/faraday/Core/fsd0a_a/2007Q1v1.7/GENERIC_CORE_1D2V/FrontEnd/synopsys/
rc:/> set_attribute library fsd0a_a_generic_core_1d2vtc.lib
Info    : Created nominal operating condition. [LBR-412]
        : Operating condition '_nominal_' was created for the PVT values (1.000000, 1.200000, 25.000000) in library 'fsd0a_a_generic_core_1d2vtc.lib'.
        : The nominal operating condition represents either the nominal PVT values if specified in the library source, or the default PVT values (1.0, 1.0, 1.0).

  Message Summary for Library fsd0a_a_generic_core_1d2vtc.lib:
  ************************************************************
  An unsupported construct was detected in this library. [LBR-40]: 1
  Found 'statetable' group in cell. [LBR-83]: 16
  Created nominal operating condition. [LBR-412]: 1
 
  Setting attribute of root '/': 'library' = fsd0a_a_generic_core_1d2vtc.lib
rc:/> set_attribute hdl_vhdl_environment common
  Setting attribute of root '/': 'hdl_vhdl_environment' = common
rc:/> set_attribute hdl_vhdl_read_version 1993
  Setting attribute of root '/': 'hdl_vhdl_read_version' = 1993
rc:/> set_attribute hdl_language vhdl
  Setting attribute of root '/': 'hdl_language' = vhdl
rc:/> read_hdl shift_adder.vhd
rc:/> elaborate
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'DBAHRBX1'.
        : Rising edge-triggered sequential cells should have rising hold/setup checks and falling edge-triggered sequential cells should have falling hold/setup checks.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'DBAHRBX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'DBAHRBX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHRBX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHRBX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHRBX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'DLAHX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'QDBAHX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'QDBAHX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'GB' and 'D' has the 'setup_rising' value whereas the 'timing_type' for the timing arc between pins 'GB' and 'Q' has the 'falling_edge' value in library cell 'QDBAHX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHRBX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHRBX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHRBX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHSX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHSX2'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHSX3'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHX1'.
Warning : Mismatch in 'timing_type' values for setup and clock timing arcs. [LBR-420]
        : The 'timing_type' for the setup check between pins 'G' and 'D' has the 'setup_falling' value whereas the 'timing_type' for the timing arc between pins 'G' and 'Q' has the 'rising_edge' value in library cell 'QDLAHX2'.
  Library has 453 usable logic and 145 usable sequential lib-cells.
Info    : Found unusable library cells. [LBR-415]
        : Library: 'fsd0a_a_generic_core_1d2vtc.lib', Total cells: 630, Unusable cells: 10.
	List of unusable cells: 'ANT BHD1 CKLD FILLER16E FILLER32E FILLER4E FILLER64E FILLER8E RAM5X1 RAM5X2 .'
        : For more information, refer to 'Cells Identified as Unusable' in the RC User Guide. The number of unusable cells that is listed depends on the setting of the 'information_level' root attribute. If set to a value less than 6, the list is limited to 10 unusable cells. If set to a value equal to or higher than 6, all unusable cells are listed.
Info    : Elaborating Design. [ELAB-1]
        : Elaborating top-level block 'shift_adder' from file 'shift_adder.vhd'.
Warning : Using default parameter value for module elaboration. [CDFG-818]
        : Elaborating block 'shift_adder' with default parameters value.
Info    : Done Elaborating Design. [ELAB-3]
        : Done elaborating 'shift_adder'.
/designs/shift_adder
rc:/> define_clock -period 2000 -name clk [clock]
wrong # args: should be "clock subcommand ?argument ...?"
rc:/> define_clock -period 2000 -name clk clock
/designs/shift_adder/timing/clock_domains/domain_1/clk
rc:/> set_attribute clock_network_late_latency 450 clk
  Setting attribute of clock 'clk': 'clock_network_late_latency' = 450.0 450.0 450.0 450.0
rc:/> set_attribute clock_source_early_latency 400 clk
  Setting attribute of clock 'clk': 'clock_source_early_latency' = 400.0 400.0 400.0 400.0
rc:/> set_attribute clock_setup_uncertainty 475 clk
  Setting attribute of clock 'clk': 'clock_setup_uncertainty' = 475.0 475.0
rc:/> set_attribute clock_hold_uncertainty 270 clk
  Setting attribute of clock 'clk': 'clock_hold_uncertainty' = 270.0 270.0
rc:/> external_delay -clock clk -input 100 [find /des* -port ports_in/*]
/designs/shift_adder/timing/external_delays/in_del_1
rc:/> external_delay -clock clk -output 400 [find /des* -port ports_out/*]
/designs/shift_adder/timing/external_delays/ou_del_1
rc:/> synthesize -to_mapped
Info    : Deleting instances not driving any primary outputs. [GLO-32]
        : Deleting 1 hierarchical instance.
        : Optimizations such as constant propagation or redundancy removal could change the connections so an instance does not drive any primary outputs anymore. To see the list of deleted instances, set the 'information_level' attribute to 2 or above.
Mapping shift_adder to gates.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'result_reg[8]'.
        : This optimization was enabled by the root attribute 'optimize_constant_0_flops'.
Info    : Deleting instances not driving any primary outputs. [GLO-32]
        : Deleting 1 sequential instance.
 
Global mapping target info
==========================
Cost Group 'default' target slack:    34 ps
Target path end-point (Port: shift_adder/result[7])

 
Global mapping status
=====================
                                    Worst 
                           Total  Weighted
Operation                   Area  Neg Slk Worst Path
-------------------------------------------------------------------------------
 global_map                  382        0  N/A
 
Global incremental target info
==============================
Cost Group 'default' target slack:    27 ps
Target path end-point (Pin: result_reg[7]/D (QDFFX1/D))

 
Global incremental optimization status
======================================
                                    Worst 
                           Total  Weighted
Operation                   Area  Neg Slk Worst Path
-------------------------------------------------------------------------------
 global_incr                 382        0  N/A
Info    : 'Conformal LEC12.1-p100' or later builds is recommended for verification. [WDO-600]
        : The use of 'Conformal LEC12.1-p100' or later builds is recommended to get better verification results.
Generating a dofile for design 'shift_adder' in file 'fv/shift_adder/rtl_to_g1.do' ...
Info    : Forcing flat compare. [WDO-212]
        : No hierarchies found in design.
Info    : Pad cells, marked as timing_model in library, will not be added to 'add notranslate modules' in the generated dofile. [WDO-215]
        : Set attribute 'wlec_use_io_pad' to 'false' to add pad cells marked as timing_model to notranslate module list in generated dofile.
 
Incremental optimization status
===============================
                                    Worst - - - - DRC Totals - - - -
                           Total  Weighted    Max       Max     Max  
Operation                   Area  Neg Slk    Trans      Cap   Fanout 
-------------------------------------------------------------------------------
 init_iopt                   382        0         0        0        0
 
Incremental optimization status
===============================
                                    Worst - - - - DRC Totals - - - -
                           Total  Weighted    Max       Max     Max  
Operation                   Area  Neg Slk    Trans      Cap   Fanout 
-------------------------------------------------------------------------------
 init_delay                  382        0         0        0        0
 init_drc                    382        0         0        0        0
 init_area                   382        0         0        0        0
 
Incremental optimization status
===============================
                                    Worst - - - - DRC Totals - - - -
                           Total  Weighted    Max       Max     Max  
Operation                   Area  Neg Slk    Trans      Cap   Fanout 
-------------------------------------------------------------------------------
 init_delay                  382        0         0        0        0
 init_drc                    382        0         0        0        0
 init_area                   382        0         0        0        0

  Done mapping shift_adder
  Synthesis succeeded.
rc:/> write_hdl > netlist_syn.v
rc:/> write_sdc > design.sdc
Finished SDC export (command execution time mm:ss (real) = 00:00).
rc:/> write_sdf design.sdf
Error   : A command argument did not match any of the acceptable command options. [TUI-64] [parse_options]
        : The argument in question is 'design.sdf'.
        : Check the command usage and correct the input to the command.
  write_sdf: writes out delay information into a Standard Delay Format (SDF) 
             file 

Usage: write_sdf  [-design <string>] [-version <string>] [-precision <integer>]
           [-timescale <string>] [-delimiter <string>] [-celltiming <string>]
           [-interconn <string>] [-edges <string>] [-condelse] [-nonegchecks]
           [-no_escape] [-nosplit_timing_check] [-no_empty_cells]
           [-no_input_port_nets] [-no_output_port_nets] [-setuphold <string>]
           [-recrem <string>] [> file]

    [-design <string>]:
        name of the top level design 
    [-version <string>]:
        specify whether to generate OVI 2.1 or 3.0. Default is 'OVI 3.0' 
    [-precision <integer>]:
        a non negative integer specifying the number of digits after decimal 
    [-timescale <string>]:
        specify the timing unit for the delay values (ns or ps). Default is 
        'ps' 
    [-delimiter <string>]:
        specifies the hierarchy divider character to be used. Valid values are 
        '/' and '.'. Default is '.' 
    [-celltiming <string>]:
        specifies the delays to be written out. Valid values are 
        'all|none|nochecks'. Default is 'all'. 'None' does not write out any 
        cell delays and timing checks. 'Nochecks' prevents writing out of 
        timing checks only. 
    [-interconn <string>]:
        specify the format for interconnect delay. Valid values are 
        'interconnect' or 'port'. Default is 'port' 
    [-edges <string>]:
        specify whether to add edge specifiers on combinational arcs. Default 
        is 'edged'. Valid options are 'edged|check_edge'. 'Check_edge' will add 
        edge specifiers only on timing check arcs. 
    [-condelse]:
        writes CONDELSE constructs with the default value when a COND construct 
        is written out. 
    [-nonegchecks]:
        negative checks not allowed for SETUP/HOLD/RECOVERY/REMOVAL 
    [-no_escape]:
        write out object names without escaping special characters 
    [-nosplit_timing_check]:
        whether to split the timing check delays for rise and fall transition 
    [-no_empty_cells]:
        suppress the writing out of empty cell descriptions. To be used with 
        '-interconn interconnect' 
    [-no_input_port_nets]:
        does not write out the nets connected to input ports. To be used with 
        '-interconn interconnect' 
    [-no_output_port_nets]:
        does not write out the nets connected to output ports. To be used with 
        '-interconn interconnect' 
    [-setuphold <string>]:
        concatenate SETUP and HOLD timing checks into SETUPHOLD. Default is 
        split. Valid options are 'split|merge_always|merge_when_paired'. 
    [-recrem <string>]:
        concatenate RECOVERY and REMOVAL timing checks into RECREM. Default is 
        split. Valid options are 'split|merge_always|merge_when_paired'. 
Failed to parse 'write_sdf design.sdf'
rc:/> write_sdf > design.sdf
Warning : Default value for an option has changed in this release. [WSDF-104]
        : Default value for -setuphold has changed from split to merge_always. Specify '-setuphold split' to preserve the behavior of the previous release.
        : Specify the option explicitly.
Warning : Default value for an option has changed in this release. [WSDF-104]
        : Default value for -recrem has changed from split to merge_always. Specify '-recrem split' to preserve the behavior of the previous release.
rc:/> exit
Normal exit.