###############################################################
#  Generated by:      Cadence Encounter 09.12-s159_1
#  OS:                Linux x86_64(Host ID drain8)
#  Generated on:      Thu Jun 11 13:49:49 2015
#  Command:           saveDesign clock_divider.enc
###############################################################
set sdc_version 1.4
current_design clock_divider
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock  -name clock -period 10 -waveform {0 5}
create_clock [get_ports {clock}]  -name clk -period 10 -waveform {0 5}
set_clock_latency -source -early -min  0.4 [get_clocks {clk}]
set_clock_latency -source -late -min  0.4 [get_clocks {clk}]
set_clock_latency -max  0.45  [get_clocks {clk}]
set_propagated_clock  [get_ports {clock}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {enable_clk3}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {enable_all}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {enable_clk1}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {enable_clk2}]
set_output_delay -add_delay 0.4 -clock [get_clocks {clk}] [get_ports {clk1}]
set_output_delay -add_delay 0.4 -clock [get_clocks {clk}] [get_ports {clk2}]
set_output_delay -add_delay 0.4 -clock [get_clocks {clk}] [get_ports {clk3}]
set_clock_uncertainty 0.27 -hold [get_clocks {clk}]
set_clock_uncertainty 0.475 -setup [get_clocks {clk}]
set_dont_use  [get_lib_cells {fsd0a_a_generic_core_1d2vtc/CKLD}]
set_dont_use  [get_lib_cells {fsd0a_a_generic_core_1d2vtc/BHD1}]
